Revit 2024 API
RebarTrimExtendData.CanAddBarGeometry Method
 Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool CanAddBarGeometry()
Visual Basic
Public Function CanAddBarGeometry As Boolean
Visual C++
public:
bool CanAddBarGeometry()
See Also
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace